#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
 [36m<=[0m read (data resources)
[0m
Terraform will perform the following actions:

[1m  # data.azurerm_kubernetes_service_versions.aks_version[0m will be read during apply
  # (config refers to values not yet known)[0m[0m
[0m [36m<=[0m[0m data "azurerm_kubernetes_service_versions" "aks_version"  {
      [32m+[0m [0m[1m[0mid[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0minclude_preview[0m[0m = false
      [32m+[0m [0m[1m[0mlatest_version[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m        = "eastus"
      [32m+[0m [0m[1m[0mversions[0m[0m        = (known after apply)

      [32m+[0m [0mtimeouts {
          [32m+[0m [0m[1m[0mread[0m[0m = (known after apply)
        }
    }

[1m  # azuread_group.aks_admin[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azuread_group" "aks_admin" {
      [32m+[0m [0m[1m[0mdescription[0m[0m             = "Azure AKS K8s administrator for azure-sample-dev cluster."
      [32m+[0m [0m[1m[0mdisplay_name[0m[0m            = "azure-sample-dev-administrator"
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mmembers[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mobject_id[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mowners[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mprevent_duplicate_names[0m[0m = false
    }

[1m  # azurerm_kubernetes_cluster.aks_cluster[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_kubernetes_cluster" "aks_cluster" {
      [32m+[0m [0m[1m[0mdns_prefix[0m[0m              = "azure-sample-dev"
      [32m+[0m [0m[1m[0mfqdn[0m[0m                    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m                      = (known after apply)
      [32m+[0m [0m[1m[0mkube_admin_config[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mkube_admin_config_raw[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mkube_config[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mkube_config_raw[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mkubelet_identity[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mkubernetes_version[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m                = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                    = "azure-sample-dev-cluster"
      [32m+[0m [0m[1m[0mnode_resource_group[0m[0m     = "azure-sample-dev-nrg"
      [32m+[0m [0m[1m[0mprivate_cluster_enabled[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mprivate_fqdn[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprivate_link_enabled[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m     = "azure-sample-dev"
      [32m+[0m [0m[1m[0msku_tier[0m[0m                = "Free"

      [32m+[0m [0maddon_profile {

          [32m+[0m [0mazure_policy {
              [32m+[0m [0m[1m[0menabled[0m[0m = true
            }

          [32m+[0m [0moms_agent {
              [32m+[0m [0m[1m[0menabled[0m[0m                    = true
              [32m+[0m [0m[1m[0mlog_analytics_workspace_id[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moms_agent_identity[0m[0m         = (known after apply)
            }
        }

      [32m+[0m [0mauto_scaler_profile {
          [32m+[0m [0m[1m[0mbalance_similar_node_groups[0m[0m      = (known after apply)
          [32m+[0m [0m[1m[0mmax_graceful_termination_sec[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_add[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_delete[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_delay_after_failure[0m[0m   = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_unneeded[0m[0m              = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_unready[0m[0m               = (known after apply)
          [32m+[0m [0m[1m[0mscale_down_utilization_threshold[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mscan_interval[0m[0m                    = (known after apply)
        }

      [32m+[0m [0mdefault_node_pool {
          [32m+[0m [0m[1m[0mavailability_zones[0m[0m   = [
              [32m+[0m [0m"1",
            ]
          [32m+[0m [0m[1m[0menable_auto_scaling[0m[0m  = true
          [32m+[0m [0m[1m[0mmax_count[0m[0m            = 1
          [32m+[0m [0m[1m[0mmax_pods[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mmin_count[0m[0m            = 3
          [32m+[0m [0m[1m[0mname[0m[0m                 = "default-pool"
          [32m+[0m [0m[1m[0mnode_count[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mnode_labels[0m[0m          = {
              [32m+[0m [0m"app"           = "system-apps"
              [32m+[0m [0m"environment"   = "dev"
              [32m+[0m [0m"nodepool-type" = "system"
              [32m+[0m [0m"nodepoolos"    = "linux"
            }
          [32m+[0m [0m[1m[0morchestrator_version[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mos_disk_size_gb[0m[0m      = 10
          [32m+[0m [0m[1m[0mos_disk_type[0m[0m         = "Managed"
          [32m+[0m [0m[1m[0mtags[0m[0m                 = {
              [32m+[0m [0m"app"           = "system-apps"
              [32m+[0m [0m"environment"   = "dev"
              [32m+[0m [0m"nodepool-type" = "system"
              [32m+[0m [0m"nodepoolos"    = "linux"
            }
          [32m+[0m [0m[1m[0mtype[0m[0m                 = "VirtualMachineScaleSets"
          [32m+[0m [0m[1m[0mvm_size[0m[0m              = "Standard_F2"
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = "SystemAssigned"
        }

      [32m+[0m [0mlinux_profile {
          [32m+[0m [0m[1m[0madmin_username[0m[0m = "ubuntu"

          [32m+[0m [0mssh_key {
              [32m+[0m [0m[1m[0mkey_data[0m[0m = (sensitive)
            }
        }

      [32m+[0m [0mnetwork_profile {
          [32m+[0m [0m[1m[0mdns_service_ip[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mdocker_bridge_cidr[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mload_balancer_sku[0m[0m  = "Standard"
          [32m+[0m [0m[1m[0mnetwork_mode[0m[0m       = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_plugin[0m[0m     = "azure"
          [32m+[0m [0m[1m[0mnetwork_policy[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0moutbound_type[0m[0m      = "loadBalancer"
          [32m+[0m [0m[1m[0mpod_cidr[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mservice_cidr[0m[0m       = (known after apply)

          [32m+[0m [0mload_balancer_profile {
              [32m+[0m [0m[1m[0meffective_outbound_ips[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0midle_timeout_in_minutes[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0mmanaged_outbound_ip_count[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ip_address_ids[0m[0m   = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ip_prefix_ids[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0moutbound_ports_allocated[0m[0m  = (known after apply)
            }
        }

      [32m+[0m [0mrole_based_access_control {
          [32m+[0m [0m[1m[0menabled[0m[0m = true

          [32m+[0m [0mazure_active_directory {
              [32m+[0m [0m[1m[0madmin_group_object_ids[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mmanaged[0m[0m                = true
              [32m+[0m [0m[1m[0mtenant_id[0m[0m              = (known after apply)
            }
        }

      [32m+[0m [0mwindows_profile {
          [32m+[0m [0m[1m[0madmin_password[0m[0m = (sensitive value)
          [32m+[0m [0m[1m[0madmin_username[0m[0m = "az_admin"
        }
    }

[1m  # azurerm_log_analytics_workspace.insights[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_log_analytics_workspace" "insights" {
      [32m+[0m [0m[1m[0mdaily_quota_gb[0m[0m             = -1
      [32m+[0m [0m[1m[0mid[0m[0m                         = (known after apply)
      [32m+[0m [0m[1m[0minternet_ingestion_enabled[0m[0m = true
      [32m+[0m [0m[1m[0minternet_query_enabled[0m[0m     = true
      [32m+[0m [0m[1m[0mlocation[0m[0m                   = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                       = (known after apply)
      [32m+[0m [0m[1m[0mportal_url[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_shared_key[0m[0m         = (sensitive value)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m        = "azure-sample-dev"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m          = 30
      [32m+[0m [0m[1m[0msecondary_shared_key[0m[0m       = (sensitive value)
      [32m+[0m [0m[1m[0msku[0m[0m                        = "PerGB2018"
      [32m+[0m [0m[1m[0mworkspace_id[0m[0m               = (known after apply)
    }

[1m  # azurerm_resource_group.aks_rg[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "aks_rg" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "azure-sample-dev"
    }

[1m  # random_pet.aksrandom[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_pet" "aksrandom" {
      [32m+[0m [0m[1m[0mid[0m[0m        = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m    = 2
      [32m+[0m [0m[1m[0mseparator[0m[0m = "-"
    }

[0m[1mPlan:[0m 5 to add, 0 to change, 0 to destroy.[0m
[0m
[1mChanges to Outputs:[0m
  [32m+[0m [0m[1m[0maks_cluster_id[0m[0m                 = (known after apply)
  [32m+[0m [0m[1m[0maks_cluster_kubernetes_version[0m[0m = (known after apply)
  [32m+[0m [0m[1m[0maks_cluster_name[0m[0m               = "azure-sample-dev-cluster"
  [32m+[0m [0m[1m[0mazure_ad_group_id[0m[0m              = (known after apply)
  [32m+[0m [0m[1m[0mazure_ad_group_objectid[0m[0m        = (known after apply)
  [32m+[0m [0m[1m[0mlatest_version[0m[0m                 = (known after apply)
  [32m+[0m [0m[1m[0mlocation[0m[0m                       = "eastus"
  [32m+[0m [0m[1m[0mresource_group_id[0m[0m              = (known after apply)
  [32m+[0m [0m[1m[0mresource_group_name[0m[0m            = "azure-sample-dev"
  [32m+[0m [0m[1m[0mversions[0m[0m                       = (known after apply)[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @hpettenuci, Action: `pull_request`, Working Directory: `./terraform/`, Workflow: `Terraform Plan`*